In [1]:
import pandas as pd

In [9]:
df=pd.read_csv('array.csv')

In [10]:
df.dtypes

A      object
IDX    object
dtype: object

In [11]:
df

                  A    IDX
0          1 20 4 2    1 0
1  5 32 42 8 92 332  3 2 1
2                23      0
3       1 2 3 4 5 6      4

In [14]:
df['A'].str.split(' ',expand=True)

    0     1     2     3     4     5
0   1    20     4     2  None  None
1   5    32    42     8    92   332
2  23  None  None  None  None  None
3   1     2     3     4     5     6

In [53]:
df['A2']=df['A'].str.split(' ').apply(lambda x: list(map(int,x)))
df['IDX2']=df['IDX'].str.split(' ').apply(lambda x: list(map(int,x)))

In [25]:
from operator import itemgetter

In [26]:
itemgetter(2,0)(df['A2'])

(['23'], ['1', '20', '4', '2'])

In [29]:
df

,A,IDX,AA,A2,IDX2
0,1 20 4 2,1 0,"[1, 20, 4, 2]","[1, 20, 4, 2]","[1, 0]"
1,5 32 42 8 92 332,3 2 1,"[5, 32, 42, 8, 92, 332]","[5, 32, 42, 8, 92, 332]","[3, 2, 1]"
2,23,0,[23],[23],[0]
3,1 2 3 4 5 6,4,"[1, 2, 3, 4, 5, 6]","[1, 2, 3, 4, 5, 6]",[4]

In [61]:
df.apply(lambda row: sum(itemgetter([] + *row['IDX2'])(row['A2'])), axis=1)

SyntaxError: invalid syntax (<ipython-input-61-b34acbdf18f4>, line 1)